### load csv

In [1]:
import numpy as np
import pandas as pd
diabetes = pd.read_csv('display_data/pima-indians-diabetes.csv')
diabetes.head()

,Number_pregnant,Glucose_concentration,Blood_pressure,Triceps,Insulin,BMI,Pedigree,Age,Class,Group
0,6,0.743719,0.590164,0.353535,0.000000,0.500745,0.234415,50,1,B
1,1,0.427136,0.540984,0.292929,0.000000,0.396423,0.116567,31,0,C
2,8,0.919598,0.524590,0.000000,0.000000,0.347243,0.253629,32,1,B
3,1,0.447236,0.540984,0.232323,0.111111,0.418778,0.038002,21,0,B
4,0,0.688442,0.327869,0.353535,0.198582,0.642325,0.943638,33,1,C

In [2]:
diabetes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 10 columns):
Number_pregnant          768 non-null int64
Glucose_concentration    768 non-null float64
Blood_pressure           768 non-null float64
Triceps                  768 non-null float64
Insulin                  768 non-null float64
BMI                      768 non-null float64
Pedigree                 768 non-null float64
Age                      768 non-null int64
Class                    768 non-null int64
Group                    768 non-null object
dtypes: float64(6), int64(3), object(1)
memory usage: 60.1+ KB

### Find all groups name

In [3]:
groups = diabetes.groupby('Group').groups
for g in groups:
    print(g)
    
# or
diabetes.groupby('Group').groups.keys()

A
B
C
D

dict_keys(['A', 'B', 'C', 'D'])

### normalize

In [4]:
col = list(diabetes.drop('Group',axis=1).columns)
diabetes[col] = diabetes[col].apply(lambda x: (x - x.min()) / (x.max()-x.min()))
diabetes[col].head()

,Number_pregnant,Glucose_concentration,Blood_pressure,Triceps,Insulin,BMI,Pedigree,Age,Class
0,0.352941,0.743719,0.590164,0.353535,0.000000,0.500745,0.234415,0.483333,1.0
1,0.058824,0.427136,0.540984,0.292929,0.000000,0.396423,0.116567,0.166667,0.0
2,0.470588,0.919598,0.524590,0.000000,0.000000,0.347243,0.253629,0.183333,1.0
3,0.058824,0.447236,0.540984,0.232323,0.111111,0.418778,0.038002,0.000000,0.0
4,0.000000,0.688442,0.327869,0.353535,0.198582,0.642325,0.943638,0.200000,1.0

### Group Values [Display values of all groups]

In [5]:
diabetes['Class'].unique()

array([1., 0.])

### Drop Column

In [6]:
diabetes.drop('Group',axis=1).head()

,Number_pregnant,Glucose_concentration,Blood_pressure,Triceps,Insulin,BMI,Pedigree,Age,Class
0,0.352941,0.743719,0.590164,0.353535,0.000000,0.500745,0.234415,0.483333,1.0
1,0.058824,0.427136,0.540984,0.292929,0.000000,0.396423,0.116567,0.166667,0.0
2,0.470588,0.919598,0.524590,0.000000,0.000000,0.347243,0.253629,0.183333,1.0
3,0.058824,0.447236,0.540984,0.232323,0.111111,0.418778,0.038002,0.000000,0.0
4,0.000000,0.688442,0.327869,0.353535,0.198582,0.642325,0.943638,0.200000,1.0

### Describe()

In [7]:
diabetes.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Number_pregnant,768.0,0.226180,0.198210,0.0,0.058824,0.176471,0.352941,1.0
Glucose_concentration,768.0,0.607510,0.160666,0.0,0.497487,0.587940,0.704774,1.0
Blood_pressure,768.0,0.566438,0.158654,0.0,0.508197,0.590164,0.655738,1.0
Triceps,768.0,0.207439,0.161134,0.0,0.000000,0.232323,0.323232,1.0
Insulin,768.0,0.094326,0.136222,0.0,0.000000,0.036052,0.150414,1.0
BMI,768.0,0.476790,0.117499,0.0,0.406855,0.476900,0.545455,1.0
Pedigree,768.0,0.168179,0.141473,0.0,0.070773,0.125747,0.234095,1.0
Age,768.0,0.204015,0.196004,0.0,0.050000,0.133333,0.333333,1.0
Class,768.0,0.348958,0.476951,0.0,0.000000,0.000000,1.000000,1.0

### DataFrame()

In [8]:
data = {'Commander': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'Date': ['2012, 02, 08', '2012, 02, 08', '2012, 02, 08', '2012, 02, 08', '2012, 02, 08'], 
        'Score': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

           Commander          Date  Score
Cochice        Jason  2012, 02, 08      4
Pima           Molly  2012, 02, 08     24
Santa Cruz      Tina  2012, 02, 08     31
Maricopa        Jake  2012, 02, 08      2
Yuma             Amy  2012, 02, 08      3

In [3]:
data = pd.DataFrame(
    data=np.random.randint(0,101,(50,4)),
    columns=['f1','f2','f3','label']
)
data.head()

   f1   f2   f3  label
0  52    8   29     64
1   6   64   84     52
2  77   75  100     40
3  79  100   94     14
4  44   73   78     32

## loc vs iloc

loc is for query by number of index <br>
iloc is for query by name

In [9]:
data.iloc[:, 0].head()

0    52
1     6
2    77
3    79
4    44
Name: f1, dtype: int64

In [8]:
data.loc[:, "f1"].head()

0    52
1     6
2    77
3    79
4    44
Name: f1, dtype: int64

### Get Data from Row, Col

In [10]:
data.iloc[0,1]

97

In [11]:
data[['f2','label']].head()

   f2  label
0  97     88
1  87     52
2  25     13
3  37     60
4  75     35

### Get All Columns

In [12]:
data.columns

Index(['f1', 'f2', 'f3', 'label'], dtype='object')

### Get Sample Data

In [13]:
data.sample(5)

    f1  f2  f3  label
25   8  48  31     20
21  73  24   8     92
14  23  80  76     34
26  51  34  14     87
12  50  76  33      6

### Random & Sort

In [14]:
randomData = data.sample(50) # random data
randomData.head()

     f1  f2  f3  label
26   51  34  14     87
49    6  21  36     11
35  100  44  89     27
6     9  88  59     28
38    8  22  83      9

In [15]:
randomData.sort_index().head() # because didn't use sort_value(inplace=True) so it's pure function

   f1  f2  f3  label
0  92  97  31     88
1  36  87  47     52
2  11  25  76     13
3  85  37  53     60
4   5  75  57     35

In [16]:
randomData.sort_values('f1').head()

    f1  f2  f3  label
10   0  86   7     22
33   1  66  80     22
7    1  56  87      1
41   5  98  51     12
4    5  75  57     35

In [17]:
randomData.head()

     f1  f2  f3  label
26   51  34  14     87
49    6  21  36     11
35  100  44  89     27
6     9  88  59     28
38    8  22  83      9

### Get n/a, None Data

In [18]:
data= pd.DataFrame(
    columns=['A','B','C'],
    data=[[1,2,None],
          [None,2,7],
          [None,2,4],
          [1,2,4],
         ],
)

null_columns = data.columns[ data.isnull().any(axis=0) ] #.any(axis=0) ::> show all row has True
print('null_columns:', null_columns)
data[ null_columns ].isnull().sum()

null_columns: Index(['A', 'C'], dtype='object')

A    2
C    1
dtype: int64

In [19]:
# Find all row that has None
data[ data.isnull().any(axis=1) ]

     A  B    C
0  1.0  2  NaN
1  NaN  2  7.0
2  NaN  2  4.0

### chained indexing
chained []
```python
ex: data['a']['b']
```

When setting values in a pandas object, care must be taken to avoid what is called chained indexing. Here is an example

[Chained Indexing](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy)

In [20]:

# ?????????? I don't get it ?????????????
# ?????????? What the different to the MultiIndex.from_product ?????
raw_data = {
    'A': {
        'AA':list('abcd'),
        'AB':list('abcd'),
    }
}
data = pd.DataFrame(data=raw_data)
data.loc[:,('A','AA')]

/Users/epinyoanun/miniconda3/lib/python3.6/site-packages/pandas/core/indexing.py:858: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_lowerdim(tup)

               A  AA
AA  [a, b, c, d] NaN
AB  [a, b, c, d] NaN

In [22]:
dfmi = pd.DataFrame([list('abcd'),
                     list('efgh'),
                     list('ijkl'),
                     list('mnop')],
                     columns=pd.MultiIndex.from_product([['one','two'],
                                                        ['first','second']]))

In [23]:
dfmi['one']['second']

0    b
1    f
2    j
3    n
Name: second, dtype: object

In [24]:
dfmi.loc[:,('one','second')]

0    b
1    f
2    j
3    n
Name: (one, second), dtype: object

### Negative of DataFrame [or Series]

In [25]:
~pd.Series([True, False, True])

0    False
1     True
2    False
dtype: bool

In [26]:
# Be carefull Number doesn't work
~pd.Series([1,0,1])

0   -2
1   -1
2   -2
dtype: int64

### Merge

In [4]:
A = pd.DataFrame(
    data = [[1,11], [2,12], [3,13]],
    columns = ['1','10']
)
B = pd.DataFrame(
    data = [[51,61], [52,62], [53,63]],
    columns = ['50','60']
)
C = pd.concat([A,B], axis=1)
C

   1  10  50  60
0  1  11  51  61
1  2  12  52  62
2  3  13  53  63

In [5]:
C[ ['1','10'] + ['60']]

   1  10  60
0  1  11  61
1  2  12  62
2  3  13  63

### Add New Column

In [18]:
C = C.assign(RESULT = pd.Series([1,0,1], index=C.index))
C = C.assign(RESULT2 = pd.Series([0,0,1], index=C.index))
C

   1  10  50  60  RESULT  RESULT2
0  1  11  51  61       1        0
1  2  12  52  62       0        0
2  3  13  53  63       1        1

### Select by Data

In [20]:
C.loc[C['RESULT']==1]

   1  10  50  60  RESULT  RESULT2
0  1  11  51  61       1        0
2  3  13  53  63       1        1

### Select by Multiple Data

In [21]:
C.loc[ (C['RESULT']==1) & (C['60']==61) ]

   1  10  50  60  RESULT  RESULT2
0  1  11  51  61       1        0

In [22]:
C.query('RESULT==1 and RESULT2==1') # I tried column as a number it didn't work properly.

   1  10  50  60  RESULT  RESULT2
2  3  13  53  63       1        1